In [1]:
import pandas
import numpy

In [2]:
serie = pandas.Series([1,2,3,4],
                     index=["a","b","c","d"])

In [3]:
serie["a"]

1

In [16]:
serie2 = serie.reindex(["b","d","a","c","e"])
serie2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [8]:
serie3 = pandas.Series(["azul","amarillo","rojo"],
                      index=[0,2,4])
serie3

0        azul
2    amarillo
4        rojo
dtype: object

In [12]:
serie3.reindex(range(6),method="ffill") # AÃ±ade valores a los nuevos indices, si no NaN

0        azul
1        azul
2    amarillo
3    amarillo
4        rojo
5        rojo
dtype: object

In [33]:
dataframe = pandas.DataFrame(numpy.arange(9).reshape(3,3),
                            index=["a","c","d"],
                            columns=["Mateo","Tomas","Cati"])
dataframe

   Mateo  Tomas  Cati
a      0      1     2
c      3      4     5
d      6      7     8

In [34]:
dataframe2 = dataframe.reindex(["d","c","b","a"])
dataframe2

   Mateo  Tomas  Cati
d    6.0    7.0   8.0
c    3.0    4.0   5.0
b    NaN    NaN   NaN
a    0.0    1.0   2.0

In [35]:
nombres = ["Cati","Mateo", "Tomas"]
dataframe2.reindex(columns=nombres)

   Cati  Mateo  Tomas
d   8.0    6.0    7.0
c   5.0    3.0    4.0
b   NaN    NaN    NaN
a   2.0    0.0    1.0

In [36]:
dataframe.loc[["c","d","a"]]

   Mateo  Tomas  Cati
c      3      4     5
d      6      7     8
a      0      1     2

In [39]:
serie = pandas.Series(numpy.arange(5.),
                     index=["a","b","c","d","e"])
serie

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [42]:
serie4=serie.drop("b")
serie4

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [43]:
serie4.drop(["c","d"])

a    0.0
e    4.0
dtype: float64

In [45]:
dataframe4 = pandas.DataFrame(numpy.arange(16).reshape(4,4),
                              index=["Cati","Mateo","Tomas","Alex"],
                              columns=list("ABCD")) # lo mismo que ["A","B","C","D"]
dataframe4

        A   B   C   D
Cati    0   1   2   3
Mateo   4   5   6   7
Tomas   8   9  10  11
Alex   12  13  14  15

In [46]:
dataframe4.drop(["Cati","Mateo"])

        A   B   C   D
Tomas   8   9  10  11
Alex   12  13  14  15

In [47]:
dataframe4.drop("A",axis=1)

        B   C   D
Cati    1   2   3
Mateo   5   6   7
Tomas   9  10  11
Alex   13  14  15

In [48]:
 dataframe4.mean(axis="index")

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64